# spell-checker:disable
tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mas-cli/tap"
brew "awscli"
brew "bat"
brew "node"
brew "glib"
brew "chezmoi"
brew "diff-so-fancy"
brew "duti"
brew "libssh2"
brew "libgit2"
brew "eza"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "librist"
brew "tesseract"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "git"
brew "git-lfs"
brew "handbrake"
brew "httpie"
brew "huggingface-cli"
brew "mas"
brew "jq"
brew "qt"
brew "mkvtoolnix"
brew "mosh"
brew "prettier"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "netcat"
brew "nnn"
brew "noti"
brew "numpy"
brew "nvm"
brew "pytorch"
brew "openai-whisper"
brew "pipx"
brew "shellcheck"
brew "sourcery"
brew "ssh-copy-id"
brew "starship"
brew "swift-format"
brew "swiftformat"
brew "swiftgen"
brew "telnet"
brew "tig"
brew "tldr"
brew "yt-dlp"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "alt-tab"
# cask "altair-graphql-client"
cask "arc"
cask "bruno"
cask "cleanshot"
cask "cursor"
cask "daisydisk"
cask "discord"
cask "dropbox"
cask "fantastical"
cask "figma"
cask "flux"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "google-chrome"
cask "jordanbaird-ice"
cask "hammerspoon"
cask "heynote"
cask "home-assistant"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "launchbar"
cask "lookaway"
cask "mimestream"
cask "pika"
cask "plex"
cask "rapidapi"
cask "rectangle-pro"
cask "reflex"
cask "slack"
cask "sonos"
cask "spotify"
cask "tailscale"
cask "transmit"
cask "transnomino"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "xcodes"
mas "1Password for Safari", id: 1569813296
mas "A Companion for SwiftUI", id: 1485436674
mas "Bakery", id: 1575220747
mas "Cleft", id: 6479458038
mas "Craft", id: 1487937127
mas "Developer", id: 640199958
mas "Diffusers", id: 1666309574
mas "DoMarks", id: 1518886084
mas "Drafts", id: 1435957248
mas "Due", id: 524373870
mas "Flame", id: 325206381
mas "Flighty", id: 1358823008
mas "GIFwrapped", id: 782319880
mas "Hyperduck", id: 6444667067
mas "In Your Face", id: 1476964367
mas "Just Press Record", id: 1033342465
mas "MakePass", id: 1450989464
mas "OpenIn", id: 1643649331
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Soulver 3", id: 1508732804
mas "SourceryPro", id: 1561780836
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
# vscode "arcanis.vscode-zipfs"
# vscode "bazelbuild.vscode-bazel"
# vscode "chwoerz.ts-worksheet"
# vscode "datadog.datadog-vscode"
# vscode "dbaeumer.vscode-eslint"
# vscode "denoland.vscode-deno"
# vscode "docker.docker"
# vscode "eamodio.gitlens"
# vscode "editorconfig.editorconfig"
# vscode "emilast.logfilehighlighter"
# vscode "esbenp.prettier-vscode"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "golang.go"
# vscode "graphql.vscode-graphql"
# vscode "graphql.vscode-graphql-syntax"
# vscode "jasonnutter.vscode-codeowners"
# vscode "kakumei.ts-debug"
# vscode "llvm-vs-code-extensions.lldb-dap"
# vscode "mgmcdermott.vscode-language-babel"
# vscode "mohsen1.prettify-json"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode.remote-explorer"
# vscode "ofhumanbondage.react-proptypes-intellisense"
# vscode "oven.bun-vscode"
# vscode "pbkit.vscode-pbkit"
# vscode "pflannery.vscode-versionlens"
# vscode "prisma.prisma"
# vscode "redhat.java"
# vscode "streetsidesoftware.code-spell-checker"
# vscode "stylelint.vscode-stylelint"
# vscode "sweetpad.sweetpad"
# vscode "swiftlang.swift-vscode"
# vscode "tamasfe.even-better-toml"
# vscode "unifiedjs.vscode-mdx"
# vscode "usernamehw.errorlens"
# vscode "vadimcn.vscode-lldb"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# # vscode "wallabyjs.console-ninja"
# # vscode "wallabyjs.quokka-vscode"
# # vscode "wallabyjs.wallaby-extension-pack"
# # vscode "wallabyjs.wallaby-vscode"
# vscode "wix.vscode-import-cost"
# vscode "yoavbls.pretty-ts-errors"
