tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mas-cli/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Mac App Store command-line interface
brew "mas"
# Cross-platform application and UI framework
brew "qt"
# Remote terminal application
brew "mosh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Utility for managing network connections
brew "netcat"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Trigger notifications when a process completes
brew "noti"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Meta-programming for Swift, stop writing boilerplate code
brew "sourcery"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# JavaScript package manager
brew "yarn"

brew "shellcheck"
brew "tldr"
brew "fd"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Opensource IDE for exploring and testing api's
cask "bruno"
# App launcher and switcher
cask "charmstone"
# Open links in any browser
cask "choosy"
# Screen capturing tool
cask "cleanshot"
# Write, edit, and chat about your code with AI
cask "cursor"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Calendar software
cask "fantastical"
# Collaborative team software
cask "figma"
# Screen colour temperature controller
cask "flux"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Automated organisation
cask "hazel"
# Dedicated scratchpad for developers
cask "heynote"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# Productivity tool
cask "launchbar"
# Break time reminder app
cask "lookaway"
# Colour picker for colours onscreen
cask "pika"
# All-in-one bookmark manager
cask "raindropio"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Window snapping tool
cask "rectangle-pro"
# Media key forwarder for Music (iTunes) and Spotify
cask "reflex"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Mind mapping and brainstorming tool
cask "xmind"
# Video communication and virtual meeting platform
cask "zoom"
cask "tailscale"
mas "1Password for Safari", id: 1569813296
mas "A Companion for SwiftUI", id: 1485436674
mas "Cleft", id: 6479458038
mas "Craft", id: 1487937127
mas "Developer", id: 640199958
mas "Diffusers", id: 1666309574
mas "DoMarks", id: 1518886084
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "Due", id: 524373870
mas "Flighty", id: 1358823008
mas "GIFwrapped", id: 782319880
mas "Hush", id: 1544743900
mas "Hyperduck", id: 6444667067
mas "In Your Face", id: 1476964367
mas "Just Press Record", id: 1033342465
mas "Muse", id: 1501563902
mas "NiceCopy", id: 6737711441
mas "OneTab", id: 1540160809
mas "OpenIn", id: 1643649331
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Paste", id: 967805235
mas "Pasteboard", id: 1499215709
mas "RegExp", id: 1546140065
mas "SourceryPro", id: 156178083
mas "SQLiteFlow", id: 1378587993
mas "StopTheMadness", id: 1376402589
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "Timery", id: 1425368544
mas "Type", id: 1664249924
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
vscode "chwoerz.ts-worksheet"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "kakumei.ts-debug"
vscode "mgmcdermott.vscode-language-babel"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ofhumanbondage.react-proptypes-intellisense"
vscode "oven.bun-vscode"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "sswg.swift-lang"
vscode "sweetpad.sweetpad"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-extension-pack"
vscode "wallabyjs.wallaby-vscode"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
